---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.EnergyModelType.BuildingElement
enum: Autodesk.Revit.DB.Analysis.EnergyModelType
source: html/18bdee57-3fa2-b6cd-0dea-24ff66a5f97e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyModelType.BuildingElement

The building element based energy analytical model.